What is pandas ?

pandas is an open source python library that contains data structures and tools for dealing with data (http://pandas.pydata.org/).

Why pandas ?

pandas is very intuitive and used a dataframe theme to handle data.
A bit like excel spreadsheet, but many, many times more powerful ad flexible.

Which dataset are we doing ?

The Titanic dataset which consists of details of the majority of passengers who travelled on RMS Titanic.

"The sinking of the RMS Titanic is one of the most infamous shipwrecks in history.  On April 15, 1912, during her maiden voyage, the Titanic sank after colliding with an iceberg, killing 1502 out of 2224 passengers and crew. This sensational tragedy shocked the international community and led to better safety regulations for ships.

One of the reasons that the shipwreck led to such loss of life was that there were not enough lifeboats for the passengers and crew. Although there was some element of luck involved in surviving the sinking, some groups of people were more likely to survive than others, such as women, children, and the upper-class"



source: kaggle.com

In [7]:
import pandas as pd
#import seaborn as sns

%matplotlib inline

In [9]:
%pwd

'C:\\Users\\Jordan Lian\\OneDrive - Northeastern University\\Spring 2021\\INFO 6101\\Module II'

In [10]:
# Read in the titanic dataset as a pandas dataframe. Change path_to_file to where the fule is stored in your laptop

my_df = pd.read_csv('Titanic.csv')

# Find out dimensions of the dataframe
my_df.shape

(891, 12)

In [61]:
#Different file types that can be read in (demo), sql, tables, json, etc.
pd.

SyntaxError: invalid syntax (<ipython-input-61-45cb98027fbc>, line 2)

In [24]:
# Look at top five rows of the dataframe

my_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
my_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
# Look at last five rows of our dataframe

my_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [12]:
#Select any column/s by column name
my_df[["Name","Fare"]].head()

                                                Name     Fare
0                            Braund, Mr. Owen Harris   7.2500
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  71.2833
2                             Heikkinen, Miss. Laina   7.9250
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  53.1000
4                           Allen, Mr. William Henry   8.0500

In [ ]:
my_df.columns

In [62]:
#Select any column by integer position
my_df.iloc[0:3,5:7]

    Age  SibSp
0  22.0      1
1  38.0      1
2  26.0      0

In [13]:
#Select any row by integer position
my_df[0:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [15]:
# Select specific rows that match a given condition

select_df = my_df[my_df["Sex"] == "male"]
select_df.shape
#select_df.tail()

(577, 12)

In [17]:
my_df["Sex"].unique()

array(['male', 'female'], dtype=object)

In [ ]:
# How to sort a dataframe

sorted_df = my_df.sort_values(by = ["Name","Age"], inplace = False)
sorted_df.head()

In [63]:
# How to transpose a dataframe

my_df_T = my_df.T
my_df_T.head()

,0,1,2,3,4,5,6,7,8,9,...,881,882,883,884,885,886,887,888,889,890
PassengerId,1,2,3,4,5,6,7,8,9,10,...,882,883,884,885,886,887,888,889,890,891
Survived,0,1,1,1,0,0,0,0,1,1,...,0,0,0,0,0,0,1,0,1,0
Pclass,3,1,3,1,3,3,1,3,3,2,...,3,3,2,3,3,2,1,3,1,3
Name,"Braund, Mr. Owen Harris","Cumings, Mrs. John Bradley (Florence Briggs Th...","Heikkinen, Miss. Laina","Futrelle, Mrs. Jacques Heath (Lily May Peel)","Allen, Mr. William Henry","Moran, Mr. James","McCarthy, Mr. Timothy J","Palsson, Master. Gosta Leonard","Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)","Nasser, Mrs. Nicholas (Adele Achem)",...,"Markun, Mr. Johann","Dahlberg, Miss. Gerda Ulrika","Banfield, Mr. Frederick James","Sutehall, Mr. Henry Jr","Rice, Mrs. William (Margaret Norton)","Montvila, Rev. Juozas","Graham, Miss. Margaret Edith","Johnston, Miss. Catherine Helen ""Carrie""","Behr, Mr. Karl Howell","Dooley, Mr. Patrick"
Sex,male,female,female,female,male,male,male,male,female,female,...,male,female,male,male,female,male,female,female,male,male

In [ ]:
my_df_T.shape

# Drill Time !

For each question, you can type in the response below it i.e.open up a new code cell below it and write code there !

From this dataset, how many passengers were male ?

In [44]:
# male and female passengers
my_df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [47]:
# male passengers
my_df.loc[my_df.Sex == 'male'].shape[0]

577

From this dataset, how many passengers were female ?

In [48]:
# female passengers
my_df.loc[my_df.Sex == 'female'].shape[0]

314

How many male passengers survived the sinking ? (0 = No, 1 = Yes)

In [42]:
# how many male and female survivors
my_df.loc[my_df.Survived == 1].groupby('Sex')['Survived'].sum().reset_index(name = 'Survivors')

      Sex  Survivors
0  female        233
1    male        109

In [37]:
# male survivors
my_df.loc[(my_df.Survived == 1) & (my_df.Sex == "male")].shape[0]

109

How many female passengers survived the sinking ?

In [41]:
# female survivors
my_df.loc[(my_df.Survived == 1)  & (my_df.Sex == 'male')].shape[0]

109

How many people above age 25 were in the ship at the time of sinking ?

In [38]:
# people above age 25 in the ship, shape[0] is rows, shape[1] is columns
my_df.loc[my_df.Age > 25].shape[0]

413

How many females below age 50 survived the sinking ?

In [52]:
# females below age 50 who survived
my_df.loc[(my_df.Age < 50) & (my_df.Survived == 1) & (my_df.Sex == 'female')].shape[0]

177

How many people who travelled Pclass 1 survived ?

In [49]:
# survivors by Pclass
my_df.loc[my_df.Survived == 1].groupby('Pclass')['Survived'].sum().reset_index(name = 'Survivors')

   Pclass  Survivors
0       1        136
1       2         87
2       3        119

In [53]:
# survivors in PClass1
my_df.loc[(my_df.Survived == 1) & (my_df.Pclass == 1)].shape[0]

136

How many people who travelled Pclass 3 survived ?

In [54]:
# survivors in PClass3
my_df.loc[(my_df.Survived == 1) & (my_df.Pclass == 3)].shape[0]

119

Can you make a dataframe of all passengers sorted by their age ?

In [68]:
# data frame of all passengers sorted by age
age_df = my_df.sort_values('Age')
age_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S

How many people below age 20 survived the sinking ?

In [64]:
# how many people below aged 20 survived the sinking?
my_df.loc[(my_df.Survived == 1) & (my_df.Age < 20 )].shape[0]

79